jmeter/full_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="Movie Info — Full Performance Test (10M requests)" enabled="true">
      <stringProp name="TestPlan.comments">
        Full performance test: 200 concurrent users × 50,000 loops = 10,000,000 total requests.
        Run this TWICE:
          Run 1 — CACHE_ENABLED=false  → results/cache_off_results.jtl
          Run 2 — CACHE_ENABLED=true   → results/cache_on_results.jtl
        ALWAYS run in non-GUI mode (jmeter -n) for accurate results.
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                   guiclass="ArgumentsPanel" testclass="Arguments"
                   testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_HOST" elementType="Argument">
            <stringProp name="Argument.name">BASE_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.desc">Target host</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="BASE_PORT" elementType="Argument">
            <stringProp name="Argument.name">BASE_PORT</stringProp>
            <stringProp name="Argument.value">8082</stringProp>
            <stringProp name="Argument.desc">Target port</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <!-- OUTPUT_FILE is overridden from CLI: -Joutput_file=cache_on_results.jtl -->
          <elementProp name="OUTPUT_FILE" elementType="Argument">
            <stringProp name="Argument.name">OUTPUT_FILE</stringProp>
            <stringProp name="Argument.value">results/full_results.jtl</stringProp>
            <stringProp name="Argument.desc">JTL output file path (override from CLI)</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ═══════════════════════════════════════════════════════
           CSV Dataset — recycles 100 real TMDB IDs
           shareMode.all = single shared pointer across all threads
           so different threads get different IDs (no lock contention)
           ═══════════════════════════════════════════════════════ -->
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet"
                  testname="Movie IDs CSV" enabled="true">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="filename">movie_ids.csv</stringProp>
        <boolProp name="ignoreFirstLine">false</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">movieId</stringProp>
      </CSVDataSet>
      <hashTree/>

      <!-- ═══════════════════════════════════════════════════════
           HTTP Request Defaults
           ═══════════════════════════════════════════════════════ -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement"
                         testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                     guiclass="HTTPArgumentsPanel" testclass="Arguments"
                     testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <!-- 5s connect / 30s response — generous for cold-cache TMDB calls -->
        <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        <!-- implementation=HttpClient4 for connection pooling -->
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- ═══════════════════════════════════════════════════════
           HTTP Header Manager
           ═══════════════════════════════════════════════════════ -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                     testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Connection" elementType="Header">
            <stringProp name="Header.name">Connection</stringProp>
            <stringProp name="Header.value">keep-alive</stringProp>
          </elementProp>
          <elementProp name="Accept" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- ═══════════════════════════════════════════════════════
           Thread Group
           200 users × 50,000 loops = 10,000,000 total requests
           Ramp-up: 60 s  (adds ~3.3 users/sec — smooth ramp)
           ═══════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="200 Users — Full Test (10M)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController"
                     testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <!-- 200 threads × 50,000 loops = 10,000,000 requests TOTAL -->
          <stringProp name="LoopController.loops">50000</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>

        <!-- ── HTTP Request Sampler ────────────────────────────── -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET /movies/${movieId}" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments"
                       testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/movies/${movieId}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <!-- keep-alive: reuse TCP connections — CRITICAL for throughput -->
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Response Assertion: only log failures (minimal overhead) -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected HTTP 200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- ── Listeners ───────────────────────────────────────── -->

        <!--
          IMPORTANT: When running in non-GUI mode (-n), this ResultCollector
          writes ALL sample data to the JTL file. The filename is set via the
          OUTPUT_FILE variable which you override from the CLI:
            -l results/cache_off_results.jtl

          Keep responseData=false and samplerData=false to minimise I/O overhead.
          For 10M rows, even "bytes per sample" matters.
        -->
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                         testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <!-- This filename is OVERRIDDEN by the -l flag in CLI mode.
               It only applies when opened in GUI mode. -->
          <stringProp name="filename">${OUTPUT_FILE}</stringProp>
        </ResultCollector>
        <hashTree/>

        <!-- Aggregate Report — visible in GUI; no file write during run -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                         testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

        <!--
          Generate Summary Results — prints a running summary to stdout every 30 s.
          Very useful for monitoring an overnight run without opening the GUI.
        -->
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector"
                         testname="Generate Summary Results" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>